Autodesk.Revit.DB.HermiteSplineTangents.EndTangent
The tangent vector at the end of the curve.
This must be a nomalized unit vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: endTangent has zero length.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The end tangent value is not set.
Since:
2014

Autodesk.Revit.DB.HermiteSplineTangents.StartTangent
The tangent vector at the start of the curve.
This must be a nomalized unit vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: startTangent is not length 1.0.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The start tangent value is not set.
Since:
2014